testCase1_potentialFoam_KVLCC2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


solvers
{
	Phi
	{
		solver          GAMG;
		smoother        DIC;
	        tolerance       1e-06;
		relTol          0.01;	
	}

	p
	{
		$Phi;
	}


	"cellDisplacement.*"
	        {
			solver       GAMG;
			smoother     GaussSeidel;
			tolerance    1e-09;
			relTol       0;
	        }
       /* yPsi
		{
			solver       GAMG;
			smoother     GaussSeidel;
			tolerance    1e-09;
			relTol       0.0;
	yPsiFinal
		{
			$yPsi;
		}*/

}

potentialFlow
{
	PhiRefCell 0;
	PhiRefValue 0;
	nNonOrthogonalCorrectors 6;
}





// ************************************************************************* //
